tutorials/OF-RTM/Brinkman/constant/porosityProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.1                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      porosityProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

porosity1
{
    type            fiberDarcyForchheimer;
    active          yes;
    cellZone        layer1;

    fiberDarcyForchheimerCoeffs
    {
        // name of boundaries to calculate thickness direction from
		calcThickness true;
        thicknessWall upperWall;       
		
        type tabularData;
		
		tabularDataCoeffs
        {
            //type: exponential, linear, spline
            interpolation exponential;
            FVF (0 0.5);			
            K1 (1E-2 1E-2);
            K2 (1E-2 1E-2);
            K3 (1E-2 1E-2);
        }	
    }
}

// ************************************************************************* //
