tutorials/OF-RTM/Brinkman/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.0.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     RTMFoam;

startFrom       startTime;

startTime       0;

stopAt          endTime;

endTime         100;

fullValue	    1;

deltaT          0.1;

writeControl    adjustableRunTime;

writeInterval   10;

purgeWrite      0;

writeFormat     ascii;

writePrecision  8;

writeCompression off;

timeFormat      general;

timePrecision   8;

runTimeModifiable yes;

adjustTimeStep  yes;

maxCo		0.3;
maxAlphaCo	0.4;

maxDeltaT	5;

libs 	(
		"libsampling.so"	
	);
// ************************************************************************* //
functions
{
	p_1	
	{
		type probes; 		
		probeLocations 
		(
			(0.0 0.0 0.001)
		);		
		fields
		(
			p
		);
	}
	p_2	
	{
		type probes; 		
		probeLocations 
		(
			(0.02 0.0 0.001)
		);		
		fields
		(
			p
		);
	}
	p_3	
	{
		type probes; 		
		probeLocations 
		(
			(0.05 0.0 0.001)
		);		
		fields
		(
			p
		);
	}
	p_4	
	{
		type probes; 		
		probeLocations 
		(
			(0.1 0.0 0.001)
		);		
		fields
		(
			p
		);
	}
	p_5	
	{
		type probes; 		
		probeLocations 
		(
			(0.15 0.0 0.001)
		);		
		fields
		(
			p
		);
	}	
	p_6	
	{
		type probes; 		
		probeLocations 
		(
			(0.2 0.0 0.001)
		);		
		fields
		(
			p
		);
	}
			
}

